# ООП - Объектно-ориентированное программирование
# ВЫПОЛНЕНО - концепции ООП
# TODO - создание класса Python
# TODO - магия Python

# Императивный стиль - четкий набор инструкций для обработки интерпритатором

# Создание объекта
# Создать ячейку из Excel в Python

# Создание класса
# Имена классов записыватся в CamelCase
# если функции - get_value()
# если переменные - shop_list, table, text
# то классы - HouseWhereItAllHappens, BigCar, CargoPlane, BeautifulSoup, Flask, LineProfiler

class Cell:
    # атрибуты - это переменные внутри класса
    content = 1
    content_type = type(content)

    # методы - это функции внутри класса
    

# создание экземпляра (instanse) класса
#   x = 1
#   text = 'Hello' 
A1 = Cell()
B2 = Cell()

# Вызвать атрибуты экземпляра
print(A1.content)



